BaseKinoteatr/src/DataProcessors/СформироватьСеансы/СформироватьСеансы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СформироватьСеансы</name>
  <tabularSections>
    <name>Сеансы</name>
    <attributes>
      <name>ДатаСеанса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяСеанса</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кинотеатр</name>
      <type>
        <types>CatalogRef.Кинотеатры</types>
      </type>
    </attributes>
    <attributes>
      <name>Кинозал</name>
      <type>
        <types>CatalogRef.Кинозалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Фильм</name>
      <type>
        <types>CatalogRef.Фильмы</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьБилета</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

BaseKinoteatr/src/InformationRegisters/РасписаниеСеансов/РасписаниеСеансов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеСеансов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВремяСеанса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Зал</name>
    <type>
      <types>CatalogRef.Кинозалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Кинотеатр</name>
    <type>
      <types>CatalogRef.Кинотеатры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BaseKinoteatr/src/DataProcessors/СформироватьСеансы/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаписатьДанныеОСеансахВРегистрНаСервере()
	
	НомерСтроки = 1;
	
	Для каждого Стр Из Объект.Сеансы Цикл
		
		Если Не ЗначениеЗаполнено(Стр.ДатаСеанса) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(НомерСтроки) + " не заполнена дата сеанса!" + Символы.ПС + "Запись не будет создана!";
			Сообщение.Сообщить(); 
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.ВремяСеанса) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(НомерСтроки) + " не заполнено время сеанса!" + Символы.ПС + "Запись не будет создана!";
			Сообщение.Сообщить(); 
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Кинотеатр) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(НомерСтроки) + " не заполнен кинотеатр!" + Символы.ПС + "Запись не будет создана!";
			Сообщение.Сообщить(); 
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Кинозал) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(НомерСтроки) + " не заполнен киноазл!" + Символы.ПС + "Запись не будет создана!";
			Сообщение.Сообщить(); 
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.Фильм) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(НомерСтроки) + " не заполнен фильм!" + Символы.ПС + "Запись не будет создана!";
			Сообщение.Сообщить(); 
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Стр.СтоимостьБилета) Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " + Строка(НомерСтроки) + " не заполнена стоимость билета!" + Символы.ПС + "Запись не будет создана!";
			Сообщение.Сообщить(); 
			
			Продолжить;
			
		КонецЕсли;
		
		// Проверяем нет ли в это время сеанса в кинотетеатре + зале
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасписаниеСеансов.ВремяСеанса КАК НачалоСеанса,
		|	ДОБАВИТЬКДАТЕ(РасписаниеСеансов.ВремяСеанса, СЕКУНДА, ЕСТЬNULL(Фильмы.Длительность, 0) * 60) КАК ОкончаниеСеанса
		|ПОМЕСТИТЬ ВТ_СЕАНСЫ
		|ИЗ
		|	РегистрСведений.РасписаниеСеансов КАК РасписаниеСеансов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Фильмы КАК Фильмы
		|		ПО РасписаниеСеансов.Фильм = Фильмы.Ссылка
		|ГДЕ
		|	РасписаниеСеансов.Период = &Период
		|	И РасписаниеСеансов.Кинотеатр = &Кинотеатр
		|	И РасписаниеСеансов.Фильм = &Фильм
		|	И РасписаниеСеансов.Зал = &Зал
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СЕАНСЫ.НачалоСеанса КАК НачалоСеанса,
		|	ВТ_СЕАНСЫ.ОкончаниеСеанса КАК ОкончаниеСеанса
		|ИЗ
		|	ВТ_СЕАНСЫ КАК ВТ_СЕАНСЫ
		|ГДЕ
		|	ВТ_СЕАНСЫ.НачалоСеанса <= &ВремяСеанса
		|	И ВТ_СЕАНСЫ.ОкончаниеСеанса >= &ВремяСеанса";
		
		Запрос.УстановитьПараметр("ВремяСеанса", Стр.ВремяСеанса);
		Запрос.УстановитьПараметр("Период", Стр.ДатаСеанса);
		Запрос.УстановитьПараметр("Зал", Стр.Кинозал);
		Запрос.УстановитьПараметр("Кинотеатр", Стр.Кинотеатр);
		Запрос.УстановитьПараметр("Фильм", Стр.Фильм);
		
		Результат = Запрос.Выполнить();
		
		Если Не Результат.Пустой() Тогда
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось создать запись из строки номер " + Строка(НомерСтроки) + " так как на данное время попадает другой сеанс!";
			Сообщение.Сообщить(); 
			
			Продолжить;
			
		КонецЕсли; 
		
		
		НоваяЗапись = РегистрыСведений.РасписаниеСеансов.СоздатьМенеджерЗаписи();
		
		НоваяЗапись.Период = Стр.ДатаСеанса;
		НоваяЗапись.ВремяСеанса = Стр.ВремяСеанса;
		НоваяЗапись.Зал = Стр.Кинозал;
		НоваяЗапись.Кинотеатр = Стр.Кинотеатр;
		НоваяЗапись.Стоимость = Стр.СтоимостьБилета;
		НоваяЗапись.Фильм = Стр.Фильм;
		
		Попытка
			НоваяЗапись.Записать();
		Исключение
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось создать запись из строки " + НомерСтроки + " по причине: " + ОписаниеОшибки();
			Сообщение.Сообщить(); 
			
		КонецПопытки; 
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанныеОСеансахВРегистр(Команда)
	
	Если Объект.Сеансы.Количество() = 0 Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет данных для записи!";
		Сообщение.Сообщить(); 	
		
		Возврат;
		
	КонецЕсли; 
	
	ЗаписатьДанныеОСеансахВРегистрНаСервере();
	
КонецПроцедуры
